% ЛАБОРАТОРНА РОБОТА №1 - ПРОЛОГ
% Варіант 1 - База знань "Амнезія"
% Ткаченко Костянтин ІП-з31

вид_амнезії(антероградна).
вид_амнезії(ретроградна).
вид_амнезії(конфабуляція).
вид_амнезії(психогенна_фуга).

характеристика(антероградна, 
    'Неможливість запам\'ятовувати нові події після початку захворювання. Давні спогади зберігаються добре.').

характеристика(ретроградна, 
    'Втрата спогадів про події до початку захворювання. Нові події після травми запам\'ятовуються нормально. Часто після струсу мозку.').

характеристика(конфабуляція, 
    'Пам\'ять спотворює добре знайомі факти. Хворий вірить у неправдиві або вигадані спогади.').

характеристика(психогенна_фуга, 
    'Повна втрата ідентичності та всіх попередніх спогадів. Людина може почати нове життя в іншому місці. Зазвичай викликано сильним емоційним шоком.').


причина(антероградна, 'пошкодження гіпокампа').
причина(антероградна, 'хвороба Альцгеймера').
причина(ретроградна, 'черепно-мозкова травма').
причина(ретроградна, 'струс мозку').
причина(конфабуляція, 'синдром Корсакова').
причина(психогенна_фуга, 'сильний психологічний стрес').


органічна(антероградна).
органічна(ретроградна).
органічна(конфабуляція).

психогенна(психогенна_фуга).

втрачаються_нові(антероградна).
втрачаються_старі(ретроградна).
втрачаються_старі(психогенна_фуга).

спотворюється_память(конфабуляція).